## ex11-Dealing with NULL Values

The example data in the tables in the demo.db3 shown earlier are all accurate and complete. Every row has a value for each attribute. However, real data is usually not so clean and tidy. You will often find NULL values in some tables.

Nulls in a database can cause a few headaches. Moreover, the descriptions in the SQL standards on how to handle NULLs seem ambiguous. It is not clear from the standards documents exactly how NULLs should be handled in all [circumstances](https://www.sqlite.org/nulls.html).

Sometimes, we actually can avoid NULLs by setting the NOT NULL constrain when we create a table. However, it is worth bearing in mind that making fields NOT NULL does not always work and could create more headaches than it cures. Not all values of null mean there is a problem with the data.

SQLite NULL is the term used to represent a missing value. A NULL value in a table is a value in a field that appears to be blank. However, a NULL value should not simply thought as 0 (zero) or an empty string like ' '. It is a value of as either empty or undefined.

This notebook will present:
- How to DROP a table ***IF EXISTS***
- How to CREATE a new table from an existing table
- How to UPDATE a table with a WHERE condition
- How to COUNT NULL values with IS NULL
- How to give NULLs default values with the SQLite ***COALESCE*** function

In [1]:
%load_ext sql

### 1. Connect to database

It was mentioned before the demo.db3 is extracted from a hydrological modelling. As a result, the data in each table is tidy and complete without NULL values. However, we can create a table with NULL values for demo.

In [2]:
%sql sqlite:///data/demo.db3

u'Connected: @data/demo.db3'

If you do not remember the tables in the demo data, you can always use the following command to query.

In [3]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///data/demo.db3
Done.

[(u'rch',),
 (u'hru',),
 (u'sub',),
 (u'sed',),
 (u'watershed_daily',),
 (u'watershed_monthly',),
 (u'watershed_yearly',),
 (u'channel_dimension',),
 (u'hru_info',),
 (u'sub_info',),
 (u'rch_info',),
 (u'ave_plant',),
 (u'ave_annual_hru',),
 (u'ave_monthly_basin',),
 (u'ave_annual_basin',),
 (u'sqlite_sequence',),
 (u'watershed_yearly_bk',)]

### 2. Create a table with NULL values from an existing table

Take the table of watershed_yearly as an example.
- ***Firstly, make a backup table***

>The SQLite CREATE TABLE AS statement is used to create a table from an existing table by copying the existing table's columns.

In [4]:
%%sql sqlite://
DROP TABLE  IF EXISTS watershed_yearly_bk;
CREATE TABLE watershed_yearly_bk AS SELECT * FROM watershed_yearly

Done.
Done.

[]

Have a quick check of the backup table

In [5]:
%%sql sqlite://
SELECT YR, PREC_mm 
FROM watershed_yearly_bk
---LIMIT 3

Done.

[(1981, 895.6051025390625),
 (1982, 884.670654296875),
 (1983, 816.6605224609375),
 (1984, 867.5743408203125),
 (1985, 637.7255249023438),
 (1986, 733.8412475585938),
 (1987, 1007.8944702148438),
 (1988, 895.8466186523438),
 (1989, 930.10546875),
 (1990, 751.4553833007812),
 (1991, 984.4703369140625),
 (1992, 907.9463500976562),
 (1993, 1057.7733154296875),
 (1994, 802.126220703125),
 (1995, 696.852783203125),
 (1996, 799.9674682617188),
 (1997, 689.3775024414062),
 (1998, 843.460205078125),
 (1999, 644.3016357421875),
 (2000, 497.9516296386719),
 (2001, 512.2509155273438),
 (2002, 702.0293579101562),
 (2003, 729.9442138671875),
 (2004, 818.3781127929688),
 (2005, 855.0092163085938),
 (2006, 612.2903442382812),
 (2007, 822.1746826171875),
 (2008, 740.0899658203125),
 (2009, 1040.9012451171875),
 (2010, 905.66845703125)]

- ***Secondly, make some values as NULLs***

>SQLite UPDATE Query is used to modify the existing records in a table. You can use WHERE clause with UPDATE query to update selected rows, otherwise all the rows would be updated.

In [6]:
%%sql sqlite://
UPDATE watershed_yearly_bk
SET PREC_mm = NULL
WHERE
    PREC_mm < 850.0

18 rows affected.

[]

### 3. Find NULLs

Null values cannot be determined with an =. We need to use the IS NULL or IS NOT NULL statements to identify null values. So, to get all records with no recorded snow_depth, we could run this query.

In [7]:
%%sql sqlite://
SELECT  YR, PREC_mm
FROM watershed_yearly_bk
WHERE PREC_mm IS NULL

Done.

[(1983, None),
 (1985, None),
 (1986, None),
 (1990, None),
 (1994, None),
 (1995, None),
 (1996, None),
 (1997, None),
 (1998, None),
 (1999, None),
 (2000, None),
 (2001, None),
 (2002, None),
 (2003, None),
 (2004, None),
 (2006, None),
 (2007, None),
 (2008, None)]

The count of years with NULLs

In [8]:
%%sql sqlite://
SELECT  COUNT(YR) AS MISSING
FROM watershed_yearly_bk
WHERE PREC_mm IS NULL

Done.

[(18,)]

:) It is right the number of rows we updated.

### 4. Handle NULLs

NULLs can be ambiguous and annoying as ther are identified differently depending on data sources. Tale can have NULL values for a number of reasons such as observations that were not recorded and data corruption.

In general, there are two main strategies to handle NULLs during the query session and ***NOT*** to change original data in the table.

#### 4.1  Do nut use rows with NULL values

This strategy is quite simple as we always can filter the data with a ***WHERE IS NOT NULL*** condition. However, in practice, the data would be used at all, if the ratio of NULLs is too high.

In [9]:
%%sql sqlite://
SELECT  YR, PREC_mm
FROM watershed_yearly_bk
WHERE PREC_mm IS NOT NULL

Done.

[(1981, 895.6051025390625),
 (1982, 884.670654296875),
 (1984, 867.5743408203125),
 (1987, 1007.8944702148438),
 (1988, 895.8466186523438),
 (1989, 930.10546875),
 (1991, 984.4703369140625),
 (1992, 907.9463500976562),
 (1993, 1057.7733154296875),
 (2005, 855.0092163085938),
 (2009, 1040.9012451171875),
 (2010, 905.66845703125)]

*Calculate the counts of NULLs, NOt_NULLs and total*. Keep in mind that the ***COUNT*** function will neglet NULL values.

In [10]:
%%sql sqlite://
SELECT SUM(CASE WHEN PREC_mm IS NULL THEN 1 else 0 END) COUNT_NULLs,
       COUNT(PREC_mm) COUNT_NOT_NULLs,
       COUNT(YR) AS TOTAL
From watershed_yearly_bk

Done.

[(18, 12, 30)]

#### 4.2 Replace NULL values with sensible values***

It is recommended that you should firstly check the database document to make sure that nullable columns (columns that are allowed to have null values) have documented what a null value means from a business perspective before replacing NULL values with sensible values.

The SQLite provides a more elegant way of handling NULL values. Tha is to use the COALESCE() function that accepts two or more arguments and returns the first non-null argument into a specified default value if it is null. If all the arguments are NULL, the COALESCE function returns NULL.

The following illustrates the syntax of the COALESCE function:<br>
*** COALESCE(parameter1, parameter2, â€¦)***;<br>

Here we want all NULLs of PREC_mm to be treated as the climatological mean of NOT NULLs.

***Caluclate the mean nof NON-NULLs***

In [11]:
%%sql sqlite://
SELECT avg(PREC_mm)
From watershed_yearly_bk

Done.

[(936.1221313476562,)]

***Replace NULLs with the above mean nof NON-NULLs***

In [12]:
%%sql sqlite://
SELECT YR, COALESCE(PREC_mm, 936.122131348) as Precipitation
From watershed_yearly_bk

Done.

[(1981, 895.6051025390625),
 (1982, 884.670654296875),
 (1983, 936.122131348),
 (1984, 867.5743408203125),
 (1985, 936.122131348),
 (1986, 936.122131348),
 (1987, 1007.8944702148438),
 (1988, 895.8466186523438),
 (1989, 930.10546875),
 (1990, 936.122131348),
 (1991, 984.4703369140625),
 (1992, 907.9463500976562),
 (1993, 1057.7733154296875),
 (1994, 936.122131348),
 (1995, 936.122131348),
 (1996, 936.122131348),
 (1997, 936.122131348),
 (1998, 936.122131348),
 (1999, 936.122131348),
 (2000, 936.122131348),
 (2001, 936.122131348),
 (2002, 936.122131348),
 (2003, 936.122131348),
 (2004, 936.122131348),
 (2005, 855.0092163085938),
 (2006, 936.122131348),
 (2007, 936.122131348),
 (2008, 936.122131348),
 (2009, 1040.9012451171875),
 (2010, 905.66845703125)]

### Summary

Dealing with NULL values is a complicated task. It would be better to get assistances from domain experts or you know very clearly what the NULL vlaues were presented for.